Revit 2024 API
SpecTypeId.Reference Properties
The SpecTypeId.Reference type exposes the following members.
Properties
Name | Description
FillPattern
 Fill Pattern, in discipline Common.
Image
 Image, in discipline Common.
LoadClassification
 Load Classification, in discipline Electrical.
Material
 Material, in discipline Common.
See Also
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace